//========================================================
//
//    Copyright (c) 2008,欢乐连线工作室
//    All rights reserved.
//
//    文件名称：Altar.h
//    摘    要：祭坛
//    
//    当前版本：1.00
//    作    者：李锋军
//    完成日期：2008-3-20
//
//========================================================
#ifndef _FILE_ALTAR_H_
#define _FILE_ALTAR_H_

#include "..\..\Common/Include/PyScript\ScriptSystem.h"
class ConsortiaElem;
class CPlayer;
//****************************************************
//名字：祭坛升级条件类
//描述：祭坛每个等级的升级条件限制，作为升级的判断标准
//日期：2008-3-19
//****************************************************
struct  CAltarUpCondition 
{
	struct  ConsumRes 
	{
		int  Money;
		int  Bijou;
	} m_Consum;
	int m_LV;

	CAltarUpCondition():m_LV(0)
	{
		memset( &m_Consum, 0L, sizeof( ConsumRes ) );
	}
};

//****************************************************
//名字：祭坛供奉等级配置类
//描述：个人对祭坛供奉等级引起的数值的加成
//日期：2008-3-20
//****************************************************
struct  CAltarOblation
{
	enum ALTAR_IMPACT_TYPE{ IMPACT_ONE, IMPACT_TWO, IMPACT_THREE, IMPACT_COUNT };
	int m_LV;
	map<ALTAR_IMPACT_TYPE,float>  m_impact;
	
};

//****************************************************
//名字：CAltar
//描述：祭坛类，负责处理祭坛动作的相关处理
//日期：2008-3-20
//****************************************************
struct CAltar
{
	/*----------------------------------------------------------
      功能：祭坛类型
	  作者：李锋军
	  日期：2008-3-19
	----------------------------------------------------------*/
	enum ALTAR_TYPE{ ALTAR_ONE, ALTAR_TWO, ALTAR_THREE, ALTAR_COUNT };
	/*----------------------------------------------------------
	  功能：记录该祭坛实例的祭坛类型
	  作者：李锋军
	  日期：2008-3-19
	----------------------------------------------------------*/
	ALTAR_TYPE m_Type;
	/*----------------------------------------------------------
	  功能：祭坛升级条件限制
	  作者：李锋军
	  日期：2008-3-19
	----------------------------------------------------------*/
	std::map<int,CAltarUpCondition>  m_LVCondition;
	/*----------------------------------------------------------
	  功能：祭坛供奉等级配置
	  作者：李锋军
	  日期：2008-3-20
	----------------------------------------------------------*/
	std::map<int,CAltarOblation>  m_OblationCondition;
	/*--------------------------------------------------------
	  功能：构造函数
	  参数：eType:所有创建的祭坛的类型
	  返回：CAltar的新实例
	  作者：李锋军
	  备注：创建祭坛时调用
	  日期：2008-3-19
	----------------------------------------------------------*/
	CAltar( ALTAR_TYPE etype );
	/*--------------------------------------------------------
	  功能：祭坛初始化
	  参数：无
	  返回：bool
	  作者：李锋军
	  备注：祭坛创建后的初始化,主要是初始化祭坛本身的等级和供奉等级配置
	  日期：2008-3-19
	----------------------------------------------------------*/
	void Init();

};


//****************************************************
//名字：由公会创建的祭坛元素类
//描述：从祭坛继承而来，包含了等级资源消耗等信息
//日期：2008-3-20
//****************************************************
class CAltarElem
{
	/*-------------------------------------------*/
	/*               成员方法区               */
	/*-------------------------------------------*/
public:
	CAltarElem(CAltar::ALTAR_TYPE CAltarType, ConsortiaElem *pConsortia,PyObject* pAltar,UINT level = 1);
	~CAltarElem();

	/*--------------------------------------------------------
	  功能：祭坛升级处理
	  参数：无
	  返回：bool:升级成功返回true，否则返回false
	  作者：李锋军
	  备注：祭坛升级处理
	  日期：2008-3-19
	----------------------------------------------------------*/
	bool UpGrade();
	/*--------------------------------------------------------
	  功能：提示供奉等级
	  参数：pPlayer:提示供奉等级的玩家等级
	  返回：bool :返回供奉等级提示结果
	  作者：李锋军
	  备注：公会成员提升自己所属公会的祭坛供奉等级
	  日期：2008-3-20
	----------------------------------------------------------*/
	bool Oblation( CPlayer *pPlaye,UINT ID,int type );
	
protected:
private:
   
	/*-------------------------------------------*/
	/*               成员变量区               */
	/*-------------------------------------------*/
public:
	/*----------------------------------------------------------
	功能：祭坛等级
	作者：李锋军
	日期：2008-3-20
	----------------------------------------------------------*/
	unsigned int m_LV;
protected:
private:
	
	/*----------------------------------------------------------
	  功能：祭坛的所属公会
	  作者：李锋军
	  日期：2008-3-19
	----------------------------------------------------------*/
	ConsortiaElem *m_pConsortia;
	/*----------------------------------------------------------
	  功能：祭坛脚本对象
	  作者：李锋军
	  日期：2008-3-25
	----------------------------------------------------------*/
	PyObject* m_pAltar;

};
#endif 