//========================================================
//
//    Copyright (c) 2008,欢乐连线工作室
//    All rights reserved.
//
//    文件名称：DropItemMgr.h
//    摘    要：怪物配置掉落
//    
//    当前版本：1.01
//    作    者：李锋军
//    完成日期：2008-03-11
//    修改说明：
//
//========================================================


#ifndef _FILE_DROPITEMMGR_H 
#define _FILE_DROPITEMMGR_H

#include "ObjMgr.h"

//****************************************************
//名字：DropItemElem
//描述：怪物配置掉落元素项
//日期：2008-3-12
//****************************************************
struct  DropItemElem 
{
   /*----------------------------------------------------------
   	功能：装备基本ID
   	作者：李锋军
   	日期：2008-3-12
   ----------------------------------------------------------*/
   UINT  iBaseID;
   /*----------------------------------------------------------
   	功能：道具掉落几率
   	作者：李锋军
   	日期：2008-3-12
   ----------------------------------------------------------*/
   int   iProbability;
   /*----------------------------------------------------------
   	功能：道具附加属性
   	作者：李锋军
   	日期：2008-3-12
   ----------------------------------------------------------*/
   int   arrAppend[5];
   /*----------------------------------------------------------
   	功能：附加属性等级
   	作者：李锋军
   	日期：2008-3-13
   ----------------------------------------------------------*/
   int AppLV;
   /*----------------------------------------------------------
   功能：基本属性等级
   作者：李锋军
   日期：2008-3-13
   ----------------------------------------------------------*/
   int BaseLV;
   /*----------------------------------------------------------
   功能：附加属性个数
   作者：李锋军
   日期：2008-3-18
   ----------------------------------------------------------*/
   BYTE m_AppendCount;
   /*--------------------------------------------------------
   	功能：构造方法
   	参数：无
   	返回：DropItemElem
   	作者：李锋军
   	备注：构造方法
   	日期：2008-3-18
   ----------------------------------------------------------*/
   DropItemElem():iBaseID(0),iProbability(0),AppLV(1),BaseLV(1)
   {
	   memset(arrAppend, 0L, sizeof( arrAppend ) );
   }



};

//****************************************************
//名字：CDropItemMgr
//描述：单个怪物配置掉落配置表管理类
//日期：2008-3-12
//****************************************************
class  CDropItemMgr : public ObjMgr<DropItemElem>
{
/*-------------------------------------------*/
/*               成员方法区               */
/*-------------------------------------------*/
public:
  CDropItemMgr();
  ~CDropItemMgr();
  /*--------------------------------------------------------
  	功能：该类的初始化工作，主要是从Drop文件下加载读取相应配置
  	参数：DropFileIndex:所要加载文件的索引，如1：文件名字将是Drop1.ini
  	返回：bool，文件加载异常返回false，负责返回true
  	作者：李锋军
  	备注：仅限于怪物死亡后的配置掉落
  	日期：2008-3-12
  ----------------------------------------------------------*/
  bool Init( char* DropFileIndex );
  /*--------------------------------------------------------
  	功能：从该怪物配置道具容器中返回符合固定几率的物品基础ID
  	参数: 产生的均匀随机数
  	返回：int  返回基础ID
  	作者：李锋军
  	备注：仅限于单个怪物从该配置表中获取此ID
  	日期：2008-3-12
  ----------------------------------------------------------*/
  UINT  FindThisProbability( int Persent );
  /*--------------------------------------------------------
  	功能：找到固定基础ID的固定附加属性
  	参数：BaseID : Base基础ID
	       AppIndex : 附加属性数组下标 
  	返回：UINT 装备几率
  	作者：李锋军
  	备注：根据传入的ID和附加属性的索引得到
  	日期：2008-3-13
  ----------------------------------------------------------*/
  int GetAppendValues( UINT BaseID, int AppIndex );
  /*--------------------------------------------------------
  	功能：获取该装备附加属性的等级
  	参数：aseID : Base基础ID
  	返回：int : 附加属性等级
  	作者：李锋军
  	备注：根据BaseID获取装备附加属性的等级
  	日期：2008-3-13
  ----------------------------------------------------------*/
  int GetAppendLV( UINT BaseID );
  /*--------------------------------------------------------
  功能：获取该装备基本属性的等级
  参数：aseID : Base基础ID
  返回：int : 附加属性等级
  作者：李锋军
  备注：根据BaseID获取装备附加属性的等级
  日期：2008-3-13
  ----------------------------------------------------------*/
  int GetBaseLV( UINT BaseID );
  /*--------------------------------------------------------
  	功能：获取配置掉落附加属性个数
  	参数：BaseId:装备基础ID
  	返回：装备的附加属性个数
  	作者：李锋军
  	备注：获取BaseID所决定的装备的附加属性个数
  	日期：2008-3-18
  ----------------------------------------------------------*/
  int GetAppCount( UINT BaseID );
  
  
  


protected:

private:

/*-------------------------------------------*/
/*               成员变量区               */
/*-------------------------------------------*/

};



#endif